STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRateFreeRTOS_ANCS/STM32_WPAN/App/app_ble.c
        Notification.Evt_Opcode = ANCS_DISCONN_COMPLETE;
        Notification.connection_handle = disconnection_complete_event->Connection_Handle;
        ANCS_App_Notification(&Notification);
        gap_cmd_resp_release(0);
      }

      /* restart advertising */
      Adv_Request(APP_BLE_FAST_ADV);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
    }

    break; /* EVT_DISCONN_COMPLETE */

    case EVT_LE_META_EVENT:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (meta_evt->subevent)
      {
        case EVT_LE_CONN_UPDATE_COMPLETE:
        {
          APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */
          hci_le_connection_update_complete_event_rp0 *connection_update_complete = (hci_le_connection_update_complete_event_rp0 *) meta_evt->data;
          APP_DBG_MSG("EVT_LE_CONN_UPDATE_COMPLETE Status=0x%02X Connection_Handle=0x%04X Conn_Interval=0x%04X Conn_Latency=0x%04X Supervision_Timeout=0x%04X \n\r",
		  	connection_update_complete->Status,connection_update_complete->Connection_Handle,connection_update_complete->Conn_Interval,connection_update_complete->Conn_Latency,connection_update_complete->Supervision_Timeout);
          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
        }
          break;
        case EVT_LE_PHY_UPDATE_COMPLETE:
          APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE \n");
          evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)meta_evt->data;
          if (evt_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, status ok \n");
          }
          else
          {
            APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, status nok \n");
          }

          ret = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,&TX_PHY,&RX_PHY);
          if (ret == BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Read_PHY success \n");

            if ((TX_PHY == TX_2M) && (RX_PHY == RX_2M))
            {
              APP_DBG_MSG("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);
            }
            else
            {
              APP_DBG_MSG("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);
            } 
          }
          else
          {
            APP_DBG_MSG("Read conf not succeess \n");
          }
          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */          
          break;
        case EVT_LE_CONN_COMPLETE:
        {
          hci_le_connection_complete_event_rp0 *connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;

          HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

          if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
	   APP_DBG_MSG("EVT_LE_CONN_COMPLETE Connection_Handle=0x%04X Role=%d Peer_Address_Type=%d Peer_Address:%02X %02X %02X %02X %02X %02X \n\r",
		  	connection_complete_event->Connection_Handle,
		  	connection_complete_event->Role,
		  	connection_complete_event->Peer_Address_Type,
		  	connection_complete_event->Peer_Address[5],
		  	connection_complete_event->Peer_Address[4],
		  	connection_complete_event->Peer_Address[3],
		  	connection_complete_event->Peer_Address[2],
		  	connection_complete_event->Peer_Address[1],
		  	connection_complete_event->Peer_Address[0]);

          BleApplicationContext.connection_handle = connection_complete_event->Connection_Handle;
		  
          BleApplicationContext.Peer_Address_Type = connection_complete_event->Peer_Address_Type;
          BleApplicationContext.Peer_Address[5] = connection_complete_event->Peer_Address[5];
          BleApplicationContext.Peer_Address[4] = connection_complete_event->Peer_Address[4];
          BleApplicationContext.Peer_Address[3] = connection_complete_event->Peer_Address[3];
          BleApplicationContext.Peer_Address[2] = connection_complete_event->Peer_Address[2];
          BleApplicationContext.Peer_Address[1] = connection_complete_event->Peer_Address[1];
          BleApplicationContext.Peer_Address[0] = connection_complete_event->Peer_Address[0];
          APP_BLE_Peer_Bonded_Check();
		  
          Notification.Evt_Opcode = ANCS_CONNECTED;
          Notification.connection_handle = connection_complete_event->Connection_Handle;
	   ANCS_App_Notification(&Notification);
          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
        }
        break; /* HCI_EVT_LE_CONN_COMPLETE */

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }
    }
    break; /* HCI_EVT_LE_META_EVENT */

    case EVT_VENDOR:
      blue_evt = (evt_blue_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (blue_evt->ecode)
      {
      /* USER CODE BEGIN ecode */
        aci_gap_pairing_complete_event_rp0 *pairing_complete;

      case EVT_BLUE_GAP_LIMITED_DISCOVERABLE: 
        APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_LIMITED_DISCOVERABLE \n");
          break; /* EVT_BLUE_GAP_LIMITED_DISCOVERABLE */
          
      case EVT_BLUE_GAP_PASS_KEY_REQUEST:  
      {
        aci_gap_pass_key_req_event_rp0 *gap_evt_pass_key_req = (aci_gap_pass_key_req_event_rp0*) blue_evt->data;
        APP_DBG_MSG("EVT_BLUE_GAP_PASS_KEY_REQUEST ==> GAP_PROC_PASS_KEY_RESPONSE Connection_Handle=0x%04X \n\r",gap_evt_pass_key_req->Connection_Handle);
        GapProcReq(GAP_PROC_PASS_KEY_RESPONSE);
      }
          break; /* EVT_BLUE_GAP_PASS_KEY_REQUEST */

      case EVT_BLUE_GAP_AUTHORIZATION_REQUEST:    
        APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_AUTHORIZATION_REQUEST \n");
          break; /* EVT_BLUE_GAP_AUTHORIZATION_REQUEST */

      case EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED: 
      {
        APP_DBG_MSG("EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED slave security request is successfully sent to the master \n");
        //gap_cmd_resp_release(0);
      }
          break; /* EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED */

      case EVT_BLUE_GAP_BOND_LOST:    
      {
        APP_DBG_MSG("EVT_BLUE_GAP_BOND_LOST ==> GAP_PROC_ALLOW_REBOND \n\r");
        GapProcReq(GAP_PROC_ALLOW_REBOND);
      }
          break; /* EVT_BLUE_GAP_BOND_LOST */

      case EVT_BLUE_GAP_DEVICE_FOUND:  
        APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_DEVICE_FOUND \n");
          break; /* EVT_BLUE_GAP_DEVICE_FOUND */

      case EVT_BLUE_GAP_ADDR_NOT_RESOLVED:
         APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_DEVICE_FOUND \n");
          break; /* EVT_BLUE_GAP_DEVICE_FOUND */
      
      case (EVT_BLUE_GAP_KEYPRESS_NOTIFICATION):
         APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_KEYPRESS_NOTIFICATION \n");
          break; /* EVT_BLUE_GAP_KEY_PRESS_NOTIFICATION */    

       case (EVT_BLUE_GAP_NUMERIC_COMPARISON_VALUE):
      {
        APP_DBG_MSG(" numeric_value = %d\n", ((aci_gap_numeric_comparison_value_event_rp0 *)(blue_evt->data))->Numeric_Value);
        APP_DBG_MSG(" Hex_value = %x\n", ((aci_gap_numeric_comparison_value_event_rp0 *)(blue_evt->data))->Numeric_Value);
        APP_DBG_MSG("EVT_BLUE_GAP_NUMERIC_COMPARISON_VALUE ==> GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM \n\r");
        GapProcReq(GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM);
      }
          break;

          case (EVT_BLUE_GAP_PAIRING_CMPLT):
          {
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blue_evt->data;

            APP_DBG_MSG("EVT_BLUE_GAP_PAIRING_CMPLT, Connection_Handle=0x%04X Status=%d Reason=0x%02x \n",pairing_complete->Connection_Handle,pairing_complete->Status,pairing_complete->Reason);
            if(pairing_complete->Status == SM_PAIRING_TIMEOUT){
              APP_DBG_MSG(" ** Pairing Timeout Status=%d Reason=0x%02x , \n\r !!! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device !!! \n\r",pairing_complete->Status,pairing_complete->Reason);
              APP_BLE_Remove_Bonding_Info();
            }else if(pairing_complete->Status == SM_PAIRING_FAILED){
              APP_DBG_MSG(" ** Pairing KO Status=%d Reason=0x%02x , \n\r !!! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device !!! \n\r",pairing_complete->Status,pairing_complete->Reason);
              APP_BLE_Remove_Bonding_Info();
            }else if(pairing_complete->Status == SM_PAIRING_SUCCESS){
              uint8_t Peer_Bonded,Security_Mode, Security_Level;
              Peer_Bonded = BleApplicationContext.Peer_Bonded;
              Security_Mode = BleApplicationContext.Security_Mode;
              Security_Level = BleApplicationContext.Security_Level;
        
