STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRateFreeRTOS_ANCS/STM32_WPAN/App/app_ble.c
              APP_BLE_Peer_Bonded_Check();
              APP_DBG_MSG("EVT_BLUE_GAP_PAIRING_CMPLT  Peer_Bonded =%d => %d  Security_Mode=%d => %d Security_Level=%d => %d \n\r",
			  	Peer_Bonded,BleApplicationContext.Peer_Bonded,Security_Mode,BleApplicationContext.Security_Mode,Security_Level,BleApplicationContext.Security_Level);

              if (Peer_Bonded == 0x00)/* only for the first paring complete*/
              {		
                APP_DBG_MSG("Term Connection for the first pairing complete to save bonding infomation !!! \n\r");
        		 
                for (int loop=0;loop<10;loop++) /* */
                {
                  /* hci_disconnection_complete_event event will be generated when the link is disconnected. 
                  It is important to leave an 100 ms blank window before sending any new command (including system hardware reset), 
                  since immediately after @ref hci_disconnection_complete_event event, system could save important information in non volatile memory. */
                  int cnt = 1000000;
                  while(cnt--);
                  printf(".\n\r");
                }
        		 
                ret = aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
                if (ret == BLE_STATUS_SUCCESS)
                {
                  Notification.Evt_Opcode = ANCS_DISCONNECTING;
                  ANCS_App_Notification(&Notification);
                }		 
              }
            } /* SM_PAIRING_SUCCESS */

	     if(BleApplicationContext.Security_Request == 0x01)
             gap_cmd_resp_release(0);

          }
           break; /* EVT_BLUE_GAP_PAIRING_CMPLT */

        case EVT_BLUE_GATT_PROCEDURE_COMPLETE:
        APP_DBG_MSG(" ** EVT_BLUE_GATT_PROCEDURE_COMPLETE \n");
        /* USER CODE BEGIN EVT_BLUE_GATT_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GATT_PROCEDURE_COMPLETE */
          break; /* EVT_BLUE_GATT_PROCEDURE_COMPLETE */
      /* USER CODE END ecode */
        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        APP_DBG_MSG("\r\n\r** EVT_BLUE_GAP_PROCEDURE_COMPLETE \n");
        /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* EVT_BLUE_GAP_PROCEDURE_COMPLETE */
      }
      break; /* EVT_VENDOR */

      default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
        break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void)
{
  //ANCS_App_KeyButton1Action();
  APP_DBG_MSG("\n\r ** Term CONNECTION **  \n\r");
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

void APP_BLE_Key_Button2_Action(void)
{
  ANCS_App_KeyButton2Action();
}
  
void APP_BLE_Key_Button3_Action(void)
{
  //ANCS_App_KeyButton3Action();
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device & aci_gap_terminate \n\r");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  aci_gap_clear_security_db();
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

/* USER CODE END FD*/
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  MtxHciId = osMutexNew( NULL );
  SemHciId = osSemaphoreNew( 1, 0, NULL ); /*< Create the semaphore and make it busy at initialization */
  SemGapId = osSemaphoreNew( 1, 0, NULL ); /*< Create the semaphore and make it busy at initialization */

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint8_t index;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *bd_addr;
  uint32_t srd_bd_addr[2];
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE }; 

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  hci_reset();

  /**
   * Write the BD Address
   */

  bd_addr = BleGetBdAddress();
  aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                            CONFIG_DATA_PUBADDR_LEN,
                            (uint8_t*) bd_addr);

  /* BLE MAC in ADV Packet */
  manuf_data[ sizeof(manuf_data)-6] = bd_addr[5];
  manuf_data[ sizeof(manuf_data)-5] = bd_addr[4];
  manuf_data[ sizeof(manuf_data)-4] = bd_addr[3];
  manuf_data[ sizeof(manuf_data)-3] = bd_addr[2];
  manuf_data[ sizeof(manuf_data)-2] = bd_addr[1];
  manuf_data[ sizeof(manuf_data)-1] = bd_addr[0];

  /**
   * Write Identity root key used to derive LTK and CSRK 
   */
    aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET,
    CONFIG_DATA_IR_LEN,
                            (uint8_t*) BLE_CFG_IR_VALUE);
    
   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET,
    CONFIG_DATA_ER_LEN,
                            (uint8_t*) BLE_CFG_ER_VALUE);

   /**
   * Write random bd_address
   */
   /* random_bd_address = R_bd_address;
    aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_WR,
    CONFIG_DATA_RANDOM_ADDRESS_LEN,
                            (uint8_t*) random_bd_address);
  */

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
  srd_bd_addr[1] =  0x0000ED6E;
  srd_bd_addr[0] =  LL_FLASH_GetUDN( );
  aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );

  /**
   * Write Identity root key used to derive LTK and CSRK 
   */
    aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );
    
   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );

  /**
   * Set TX Power to 0dBm.
   */
  aci_hal_set_tx_power_level(1, CFG_TX_POWER);

  /**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

