STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRateFreeRTOS_ANCS/STM32_WPAN/App/app_ble.c
  udn = LL_FLASH_GetUDN();

  if(udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    bd_addr_udn[0] = (uint8_t)(udn & 0x000000FF);
    bd_addr_udn[1] = (uint8_t)( (udn & 0x0000FF00) >> 8 );
    bd_addr_udn[2] = (uint8_t)( (udn & 0x00FF0000) >> 16 );
    bd_addr_udn[3] = (uint8_t)device_id;
    bd_addr_udn[4] = (uint8_t)(company_id & 0x000000FF);;
    bd_addr_udn[5] = (uint8_t)( (company_id & 0x0000FF00) >> 8 );

    bd_addr = (const uint8_t *)bd_addr_udn;
  }
  else
  {
    otp_addr = OTP_Read(0);
    if(otp_addr)
    {
      bd_addr = ((OTP_ID0_t*)otp_addr)->bd_address;
    }
    else
    {
      bd_addr = M_bd_addr;
    }

  }

  return bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS
 *
 *************************************************************/
static void Add_Advertisment_Service_UUID( uint16_t servUUID )
{
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID & 0xFF);
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID >> 8) & 0xFF;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;

  return;
}

static void Adv_Mgr( void )
{
  /**
  * The code shall be executed in the background as an aci command may be sent
  * The background is the only place where the application can make sure a new aci command
  * is not sent if there is a pending one
  */
  osThreadFlagsSet( AdvUpdateProcessId, 1 );

  
  return;
}

static void AdvUpdateProcess(void *argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait( 1, osFlagsWaitAny, osWaitForever);
    Adv_Update( );
  }
}

static void Adv_Update( void )
{
  Adv_Request(APP_BLE_LP_ADV);

  return;
}

static void HciUserEvtProcess(void *argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait( 1, osFlagsWaitAny, osWaitForever);
    hci_user_evt_proc( );
  }
}

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

void APP_BLE_Peer_Bonded_Check(void)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t Security_Mode, Security_Level;

  result = aci_gap_is_device_bonded(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  if (result == BLE_STATUS_SUCCESS)
  {
    BleApplicationContext.Peer_Bonded = 0x01;
  }
  else 
  {
    BleApplicationContext.Peer_Bonded = 0x00;
  }
    
  result = aci_gap_get_security_level(BleApplicationContext.connection_handle,&Security_Mode,&Security_Level);
  BleApplicationContext.Security_Mode = Security_Mode;
  BleApplicationContext.Security_Level = Security_Level;
  if (result == BLE_STATUS_SUCCESS)
  {
  APP_DBG_MSG("Peer_Bonded=%d Security_Mode= %d, Security_Level= %d \n\r", BleApplicationContext.Peer_Bonded, Security_Mode, Security_Level);
  }

  return;	
}

void APP_BLE_Remove_Bonding_Info(void)
{
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device \n\r");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  aci_gap_clear_security_db();
  return;
}

void APP_BLE_Slave_Security_Request(void)
{
  APP_BLE_Peer_Bonded_Check();
  
  if( (BleApplicationContext.Peer_Bonded == 0x00) ||
      ( (BleApplicationContext.Peer_Bonded == 0x01) && (BleApplicationContext.Security_Mode == 0x01) && (BleApplicationContext.Security_Level == 0x01) )
    )
  {
    GapProcReq(GAP_PROC_SLAVE_SECURITY_REQ);
  }
  
  return;
}

static void GapProcReq(GapProcId_t GapProcId)
{
  tBleStatus status;

  switch(GapProcId)
  {
    case GAP_PROC_SLAVE_SECURITY_REQ:
    {
      BleApplicationContext.Security_Request = 0x01;
      status = aci_gap_slave_security_req(BleApplicationContext.connection_handle); 
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ aci_gap_slave_security_req  status=0x%02x \n\r",status);
      }
      
      //APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ waiting for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED \n\r");
      //gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED */
      //APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ waited for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED  \n\r");
      
      APP_DBG_MSG("waiting for  EVT_BLUE_GAP_PAIRING_CMPLT \n\r");
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for EVT_BLUE_GAP_PAIRING_CMPLT */
      BleApplicationContext.Security_Request = 0x00;
      APP_DBG_MSG("waited for  EVT_BLUE_GAP_PAIRING_CMPLT \n\r");
    }
    break;

    case GAP_PROC_PASS_KEY_RESPONSE:
    {
      APP_DBG_MSG("GAP_PROC_PASS_KEY_RESPONSE \n\r");
      aci_gap_pass_key_resp(BleApplicationContext.connection_handle, CFG_FIXED_PIN);/* response for EVT_BLUE_GAP_PASS_KEY_REQUEST */
    }
    break;

    case GAP_PROC_ALLOW_REBOND:
    {
      APP_DBG_MSG("GAP_PROC_ALLOW_REBOND aci_gap_allow_rebond(0x%04X)\n\r",BleApplicationContext.connection_handle);
      aci_gap_allow_rebond(BleApplicationContext.connection_handle);/* response for EVT_BLUE_GAP_BOND_LOST */
    }
    break;

    case GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.connection_handle, 1); /* CONFIRM_YES = 1 */
      
      APP_DBG_MSG("GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM ** aci_gap_numeric_comparison_value_confirm_yesno-->YES \n");
    }
    break;
		  
    case GAP_PROC_TERMINATE_CONNECTION:
    {
      APP_DBG_MSG("terminate connection \n");
      status = aci_gap_terminate(BleApplicationContext.connection_handle,0x13);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Term Connection cmd failure: 0x%x\n", status);
      }
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);
      
      APP_DBG_MSG("GAP_PROC_TERMINATE_CONNECTION complete event received\n");
    }
    break;
	  
    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(uint32_t flag)
{
  UNUSED(flag);
  osSemaphoreRelease( SemGapId );
  return;
}

static void gap_cmd_resp_wait(uint32_t timeout)
{
  UNUSED(timeout);
  osSemaphoreAcquire( SemGapId, osWaitForever );
  return;
}

